; domain
(define (domain sokoban-sequential)
(:requirements :typing :negative-preconditions)
(:types location - object direction - object player_stone - object stone - player_stone player - player_stone)
(:predicates (is-goal ?0 - location) (is-nongoal ?0 - location) (move-dir ?0 - location ?1 - location ?2 - direction) (at ?0 - player_stone ?1 - location) (clear ?0 - location) (at-goal ?0 - stone))
(:action move
:parameters (?0player - player ?1location - location ?2location - location ?3direction - direction)
:precondition (and (clear ?2location)
)
:effect (and (at ?0player ?2location) (clear ?1location)
(not (clear ?2location)) (not (at ?0player ?1location))))
(:action push-to-nongoal
:parameters (?0player - player ?1stone - stone ?2location - location ?3location - location ?4location - location ?5direction - direction)
:precondition (and (clear ?4location)
)
:effect (and (clear ?2location) (at ?0player ?3location) (at ?1stone ?4location)
(not (clear ?4location)) (not (at ?0player ?2location)) (not (at ?1stone ?3location)) (not (at-goal ?1stone))))
(:action push-to-goal
:parameters (?0player - player ?1stone - stone ?2location - location ?3location - location ?4location - location ?5direction - direction)
:precondition (and (clear ?4location)
)
:effect (and (clear ?2location) (at ?0player ?3location) (at ?1stone ?4location) (at-goal ?1stone)
(not (clear ?4location)) (not (at ?0player ?2location)) (not (at ?1stone ?3location))))
)

; problem
;; ##@##
;; ## ##
;; .$ $.

(define (problem levels/level-2.lvl)
  (:domain sokoban-sequential)

  (:objects 
    dir-down - direction
    dir-left - direction
    dir-right - direction
    dir-up - direction
    pos-01-01 - location
    pos-02-01 - location
    pos-03-01 - location
    pos-04-01 - location
    pos-05-01 - location
    pos-01-02 - location
    pos-02-02 - location
    pos-03-02 - location
    pos-04-02 - location
    pos-05-02 - location
    pos-01-03 - location
    pos-02-03 - location
    pos-03-03 - location
    pos-04-03 - location
    pos-05-03 - location
    player-01 - player
    stone-01 - stone
    stone-02 - stone
  )
  
  (:init 
    (IS-GOAL pos-01-03)
    (IS-GOAL pos-05-03)
    (IS-NONGOAL pos-01-01)
    (IS-NONGOAL pos-01-02)
    (IS-NONGOAL pos-02-01)
    (IS-NONGOAL pos-02-02)
    (IS-NONGOAL pos-02-03)
    (IS-NONGOAL pos-03-01)
    (IS-NONGOAL pos-03-02)
    (IS-NONGOAL pos-03-03)
    (IS-NONGOAL pos-04-01)
    (IS-NONGOAL pos-04-02)
    (IS-NONGOAL pos-04-03)
    (IS-NONGOAL pos-05-01)
    (IS-NONGOAL pos-05-02)
    (MOVE-DIR pos-01-03 pos-02-03 dir-right)
    (MOVE-DIR pos-02-03 pos-01-03 dir-left)
    (MOVE-DIR pos-02-03 pos-03-03 dir-right)
    (MOVE-DIR pos-03-01 pos-03-02 dir-down)
    (MOVE-DIR pos-03-02 pos-03-01 dir-up)
    (MOVE-DIR pos-03-02 pos-03-03 dir-down)
    (MOVE-DIR pos-03-03 pos-02-03 dir-left)
    (MOVE-DIR pos-03-03 pos-03-02 dir-up)
    (MOVE-DIR pos-03-03 pos-04-03 dir-right)
    (MOVE-DIR pos-04-03 pos-03-03 dir-left)
    (MOVE-DIR pos-04-03 pos-05-03 dir-right)
    (MOVE-DIR pos-05-03 pos-04-03 dir-left)
    (at player-01 pos-03-01)
    (at stone-01 pos-02-03)
    (at stone-02 pos-04-03)
    (clear pos-01-03)
    (clear pos-03-02)
    (clear pos-03-03)
    (clear pos-05-03)
  )

  (:goal (and
    (at-goal stone-01)
    (at-goal stone-02)
  ))
)

; plan
1. (move player-01 pos-03-01 pos-03-02 dir-down)
   deleted: (clear pos-03-02) (at player-01 pos-03-01)
   added: (at player-01 pos-03-02) (clear pos-03-01)
   goals met: 0 of 2
2. (move player-01 pos-03-02 pos-03-03 dir-down)
   deleted: (clear pos-03-03) (at player-01 pos-03-02)
   added: (at player-01 pos-03-03) (clear pos-03-02)
   goals met: 0 of 2
3. (push-to-goal player-01 stone-01 pos-03-03 pos-02-03 pos-01-03 dir-left)
   deleted: (clear pos-01-03) (at player-01 pos-03-03) (at stone-01 pos-02-03)
   added: (clear pos-03-03) (at player-01 pos-02-03) (at stone-01 pos-01-03) (at-goal stone-01)
   goals met: 1 of 2
4. (move player-01 pos-02-03 pos-03-03 dir-right)
   deleted: (clear pos-03-03) (at player-01 pos-02-03)
   added: (at player-01 pos-03-03) (clear pos-02-03)
   goals met: 1 of 2
5. (push-to-goal player-01 stone-02 pos-03-03 pos-04-03 pos-05-03 dir-right)
   deleted: (clear pos-05-03) (at player-01 pos-03-03) (at stone-02 pos-04-03)
   added: (clear pos-03-03) (at player-01 pos-04-03) (at stone-02 pos-05-03) (at-goal stone-02)
   goals met: 2 of 2
